In [1]:
#DemoPandas.ipynp

from pandas import Series, DataFrame
import pandas as pd

#시리즈 객체를 생성
multi = Series([100,200,300,400,500])
print(multi)
print(type(multi))

0    100
1    200
2    300
3    400
4    500
dtype: int64
<class 'pandas.core.series.Series'>

In [2]:
#인덱싱

multi[1]

200

In [8]:
multi = Series([100,200,300,400,500],
               index = ["2024-03-01","2024-03-02","2024-03-03","2024-03-04","2024-03-05" ])
#슬라이싱
multi["2024-03-02"]

#multi

200

In [9]:
import numpy as np

data = np.arange(5)
s = Series(data)
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [10]:
data = [1000,2000,3000]
s = Series(data)
s.index = ["메로나", "구구콘", "하겐다즈"]
s

메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64

In [11]:
s["구구콘"]

2000

In [17]:
data = [1000,2000,3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(data=data, index=index)

s["구구콘"]

s2 = s.reindex(["메로나", "비비빅", "구구콘"])
s2

#0으로 보정
s2.fillna(0)
s2

메로나    1000.0
비비빅       NaN
구구콘    2000.0
dtype: float64

In [16]:
s2.fillna(0)
s2

메로나    1000.0
비비빅       NaN
구구콘    2000.0
dtype: float64

In [19]:
#주식 데이터

data = {"foreigner":[1,2,3,4,5,6],
        "org":[10,20,30,40,50,60],
        "sratio":[100,200,300,400,500,600],
        "sprice":[1,2,3,4,5,6],
        "private":[10,20,30,40,50,60]}
frame = DataFrame(data)
frame

   foreigner  org  sratio  sprice  private
0          1   10     100       1       10
1          2   20     200       2       20
2          3   30     300       3       30
3          4   40     400       4       40
4          5   50     500       5       50
5          6   60     600       6       60

In [22]:
frame2 = DataFrame(data, 
                  columns=["foreigner", "private", "org", "sratio", "sprice"],
                  index=["2024-03-01","2024-03-02","2024-03-03","2024-03-04","2024-03-05","2024-03-06",])
print(frame2)
print(type(frame2))

            foreigner  private  org  sratio  sprice
2024-03-01          1       10   10     100       1
2024-03-02          2       20   20     200       2
2024-03-03          3       30   30     300       3
2024-03-04          4       40   40     400       4
2024-03-05          5       50   50     500       5
2024-03-06          6       60   60     600       6
<class 'pandas.core.frame.DataFrame'>

In [25]:
#print(frame2["private"])
frame2["private"]
#print(type(frame2["private"]))

2024-03-01    10
2024-03-02    20
2024-03-03    30
2024-03-04    40
2024-03-05    50
2024-03-06    60
Name: private, dtype: int64

In [29]:
frame2.loc["2024-03-01"]
#frame2

foreigner      1
private       10
org           10
sratio       100
sprice         1
Name: 2024-03-01, dtype: int64

In [30]:
frame2.T

           2024-03-01  2024-03-02  ...  2024-03-05  2024-03-06
foreigner           1           2  ...           5           6
private            10          20  ...          50          60
org                10          20  ...          50          60
sratio            100         200  ...         500         600
sprice              1           2  ...           5           6

[5 rows x 6 columns]

In [31]:
frame2

            foreigner  private  org  sratio  sprice
2024-03-01          1       10   10     100       1
2024-03-02          2       20   20     200       2
2024-03-03          3       30   30     300       3
2024-03-04          4       40   40     400       4
2024-03-05          5       50   50     500       5
2024-03-06          6       60   60     600       6

In [32]:
#데이터를 생성

data = {"종목코드":["037730", "036360", "005760"],
        "종목명":["3R", "3SOFT", "ACTS"],
        "현재가":[1510,1790,1185]}
df = DataFrame(data)
df

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [33]:
data = [["037730", "036360", "005760"],
        ["3R", "3SOFT", "ACTS"],
        [1510,1790,1185]]
#컬럼명
columns = ["종목코드", "종목명", "현재가"]
df = DataFrame(data=data, columns=columns)
df

     종목코드     종목명     현재가
0  037730  036360  005760
1      3R   3SOFT    ACTS
2    1510    1790    1185

In [1]:
data = [["037730", "3R", 1510],
        ["036360", "3SOFT", 1790],
        ["005760", "ACTS", 1185]]
#컬럼명
columns = ["종목코드", "종목명", "현재가"]
df = DataFrame(data=data, columns=columns)
#색인컬럼을 지정
df = df.set_index("종목코드")
#컬럼 슬라이싱
df["현재가"]
#df.loc["037730"]

NameError: name 'DataFrame' is not defined